//
//  ViewController.h
//  ZYTextCalculator
//
//  Created by 张祎 on 2017/8/24.
//  Copyright © 2017年 张祎. All rights reserved.
//

#import <UIKit/UIKit.h>

#define TEXT @"批判封建思想、封建制度对青少年的毒害思想。这些散文以“我”为线索，通过作者的亲身经历，看到封建社会、封建教育制度对青少年身心健康的摧残，使他们受到极大的伤害，表现作者强烈的反封建的战斗精神。作者无情地批判封建孝道的愚昧和残忍，揭露其虚伪性和欺骗性。在《二十四孝图》中，作者说：“其中最使我不解，甚至于发生反感的，是《老莱娱亲》和《郭巨埋儿》两件事，通过这两件事来说明愚昧的封建孝道只是骗人的把戏而已，绅士、将军者们不去实行，人们又何必要认真地去实行呢。在这里，作者把封建的孝道揭露批判得体无完肤。作者对束缚青少年成长的封建教育制度极度厌恶，控诉这种教育对儿童心灵的摧残。《五猖会》首先介绍了五猖会的盛况，接着描写作者要去看会时的兴奋和喜悦，正在作者兴高采烈地将要启程去看会时，父亲突然出现了，并严肃地让鲁迅“去拿你的书来”。接着写作者如当头浇了一盆冷水，最后父亲命令道：“给我读熟。背不出来，就不准去看会。”接着写作者背书时的痛苦和无奈，写母亲、阿长等人无法营救及等待他背熟时的焦虑。最后作者终于背将出来，大家脸上露出笑容，向河埠走去。但作者这时已是索然无味，没了兴致。这实际是对摧残少年儿童的封建教育制度的强烈控诉。全文以反问作结，实际上是作者对父亲这种行为的否定，也就是对束缚儿童成长的封建教育的否定。《从百草园到三味书屋》是作者对封建教育的又一次批判。全文对百草园的欢乐和三味书屋的乏味进行了强烈的对比。在百草园中作者的天性得到充分的显露，享受了生活的无限乐趣。作者把百草园看成是自己的乐园，回味无穷。接下来介绍三味书屋，“是全城中称为最严厉的书塾”。在这里只能是习字和对课，读那些枯燥无味和似懂非懂的文章。如果违犯了规矩，还要领教罚跪和戒尺的滋味。学生不能向老师提问课堂以外的问题。由于课堂的无聊，学生们毫无学习兴趣，所以乘老师读书兴致正浓之时，便开始各自的游戏。这实际上是对于封建教育的一种自发的抵制和反抗。通过这些描写，说明童年的鲁迅对这种束缚人的封建教育是非常厌烦的。《琐记》对自己南京求学一段生活作了总结，在这里批判了当时的教育是学非所用，爬上二十丈的桅杆不可以当个好水兵，钻进二十丈的地道也不能做个好矿工。这说明当时的教育和实践相脱节，作者对这样的教育非常不满，所以决定出国学习，继续深造。\n 批判封建思想、封建制度对青少年的毒害思想。这些散文以“我”为线索，通过作者的亲身经历，看到封建社会、封建教育制度对青少年身心健康的摧残，使他们受到极大的伤害，表现作者强烈的反封建的战斗精神。作者无情地批判封建孝道的愚昧和残忍，揭露其虚伪性和批判封建思想、封建制度对青少年的毒害思想。这些散文以“我”为线索，通过作者的亲身经历，看到封建社会、封建教育制度对青少年身心健康的摧残，使他们受到极大的伤害，表现作者强烈的反封建的战斗精神。作者无情地批判封建孝道的愚昧和残忍，揭露其虚伪性和欺骗性。在《二十四孝图》中，作者说：“其中最使我不解，甚至于发生反感的，是《老莱娱亲》和《郭巨埋儿》两件事，通过这两件事来说明愚昧的封建孝道只是骗人的把戏而已，绅士、将军者们不去实行，人们又何必要认真地去实行呢。在这里，作者把封建的孝道揭露批判得体无完肤。作者对束缚青少年成长的封建教育制度极度厌恶，控诉这种教育对儿童心灵的摧残。《五猖会》首先介绍了五猖会的盛况，接着描写作者要去看会时的兴奋和喜悦，正在作者兴高采烈地将要启程去看会时，父亲突然出现了，并严肃地让鲁迅“去拿你的书来”。接着写作者如当头浇了一盆冷水，最后父亲命令道：“给我读熟。背不出来，就不准去看会。”接着写作者背书时的痛苦和无奈，写母亲、阿长等人无法营救及等待他背熟时的焦虑。最后作者终于背将出来，大家脸上露出笑容，向河埠走去。但作者这时已是索然无味，没了兴致。这实际是对摧残少年儿童的封建教育制度的强烈控诉。全文以反问作结，实际上是作者对父亲这种行为的否定，也就是对束缚儿童成长的封建教育的否定。《从百草园到三味书屋》是作者对封建教育的又一次批判。全文对百草园的欢乐和三味书屋的乏味进行了强烈的对比。在百草园中作者的天性得到充分的显露，享受了生活的无限乐趣。作者把百草园看成是自己的乐园，回味无穷。接下来介绍三味书屋，“是全城中称为最严厉的书塾”。在这里只能是习字和对课，读那些枯燥无味和似懂非懂的文章。如果违犯了规矩，还要领教罚跪和戒尺的滋味。学生不能向老师提问课堂以外的问题。由于课堂的无聊，学生们毫无学习兴趣，所以乘老师读书兴致正浓之时，便开始各自的游戏。这实际上是对于封建教育的一种自发的抵制和反抗。通过这些描写，说明童年的鲁迅对这种束缚人的封建教育是非常厌烦的。《琐记》对自己南京求学一段生活作了总结，在这里批判了当时的教育是学非所用，爬上二十丈的桅杆不可以当个好水兵，钻进二十丈的地道也不能做个好矿工。这说明当时的教育和实践相脱节，作者对这样的教育非常不满，所以决定出国学习，继续深造。\n 批判封建思想、封建制度对青少年的毒害思想。这些散文以“我”为线索，通过作者的亲身经历，看到封建社会、封建教育制度对青少年身心健康的摧残，使他们受到极大的伤害，表现作者强烈的反封建的战斗精神。作者无情地批判封建孝道的愚昧和残忍，揭露其虚伪性和 ----  结尾证明文字"


@interface ViewController : UIViewController


@end

